УТ_для_edt/src/Catalogs/CRM_РежимыРаботы/CRM_РежимыРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_РежимыРаботы</name>
  <attributes>
    <name>Круглосуточный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСекунды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыРаботы</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачалаСекунды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончанияСекунды</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/CRM_РежимыРаботы/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ОкончаниеДня = Неопределено;
	
	Для Каждого Строка Из Объект.ПериодыРаботы Цикл
		ИндексСтроки = Объект.ПериодыРаботы.Индекс(Строка);
		Если Строка.ВремяНачала > Строка.ВремяОкончания И ЗначениеЗаполнено(Строка.ВремяОкончания) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Время начала больше времени окончания';en='Start time is greater than the end time.'"), ,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" Объект.ПериодыРаботы[%1].ВремяОкончания", ИндексСтроки), ,
				Отказ);
		КонецЕсли;
		Если Строка.ВремяНачала = Строка.ВремяОкончания Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru='Длительность интервала не определена';en='Interval duration is not specified'"), ,
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" Объект.ПериодыРаботы[%1].ВремяОкончания", ИндексСтроки), ,
				Отказ);
		КонецЕсли;
		Если ОкончаниеДня <> Неопределено Тогда
			Если ОкончаниеДня > Строка.ВремяНачала Или Не ЗначениеЗаполнено(ОкончаниеДня) Тогда
				ОбщегоНазначения.СообщитьПользователю(
					НСтр("ru='Обнаружены пересекающиеся интервалы';en='Intervals are found intersecting'"), ,
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(" Объект.ПериодыРаботы[%1].ВремяНачала", ИндексСтроки), ,
					Отказ);
			КонецЕсли;
		КонецЕсли;
		ОкончаниеДня = Строка.ВремяОкончания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
